## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 7 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      - cache_cluster_size    = "0.5" -> null
        id                    = "ags-s50ry4jhg5-v1"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_group.api_waf will be created
  + resource "aws_cloudwatch_log_group" "api_waf" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/kinesisfirehose/api_waf"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
    }

  # aws_flow_log.cloud_based_sensor will be created
  + resource "aws_flow_log" "cloud_based_sensor" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = "arn:aws:s3:::cbs-satellite-507252742351"
      + log_destination_type     = "s3"
      + log_format               = "${vpc-id} ${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status} ${subnet-id} ${instance-id}"
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-095a761b6add80a7b"
    }

  # aws_iam_policy.write_waf_logs will be created
  + resource "aws_iam_policy" "write_waf_logs" {
      + arn         = (known after apply)
      + description = "Allow writing WAF logs to S3 + CloudWatch"
      + id          = (known after apply)
      + name        = "scan-websites_WriteLogs"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-satellite-507252742351"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject*",
                          + "s3:GetObject*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-satellite-507252742351/waf_logs/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.waf_log_role will be created
  + resource "aws_iam_role" "waf_log_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scan-websites-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.write_waf_logs will be created
  + resource "aws_iam_role_policy_attachment" "write_waf_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-websites-logs"
    }

  # aws_kinesis_firehose_delivery_stream.api_waf will be created
  + resource "aws_kinesis_firehose_delivery_stream" "api_waf" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-scan-websites"
      + tags           = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "scan-websites-production"
          + "Terraform"  = "true"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-507252742351"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "UNCOMPRESSED"
          + prefix             = "waf_logs"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = true
              + log_group_name  = "/aws/kinesisfirehose/api_waf"
              + log_stream_name = "WAFLogS3Delivery"
            }
        }
    }

  # aws_wafv2_web_acl_logging_configuration.api_waf will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "api_waf" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = "arn:aws:wafv2:ca-central-1:507252742351:regional/webacl/api_waf/04c91c81-2369-4215-9e55-cb346bd7219f"
    }

Plan: 7 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.scan_websites_certificate"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.scan-websites"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.axe-core-urls"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.github-urls"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.body_exclusions"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.google_auth_uri"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["module.rds.aws_iam_policy.read_connection_string"]

28 tests, 8 passed, 20 warnings, 0 failures, 0 exceptions

```

</details>
